package hw5;
/*
1 Создать классы Собака и Кот с наследованием от класса Животное.
2 Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие. В качестве
параметра каждому методу передается величина, означающая или длину препятствия (для
бега и плавания), или высоту (для прыжков).
3 У каждого животного есть ограничения на действия (бег: кот 200 м., собака 500 м.; прыжок: кот
2 м., собака 0.5 м.; плавание: кот не умеет плавать, собака 10 м.).
4 При попытке животного выполнить одно из этих действий, оно должно сообщить результат в
консоль. (Например, dog1.run(150); -> результат: run: true)
5 * Добавить животным разброс в ограничениях. То есть у одной собаки ограничение на бег
может быть 400 м., у другой 600 м.
 */
public class AnimalsMain {
    public static void main(String[] args) {
        Cat cat1 = new Cat();
        Dog dog1 = new Dog();
        System.out.println(cat1.run(200));
        cat1.swim(5);
        cat1.jump(2);
        dog1.run(500);
        dog1.swim(10);
        dog1.jump(10);
    }
}
